erp3l/src/Catalogs/НастройкиРаспределенияЗатратМСФО/НастройкиРаспределенияЗатратМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиРаспределенияЗатратМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗакрытия</name>
    <type>
      <types>EnumRef.СпособыЗакрытияСчетовЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточникНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточникПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточникСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточникСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточникСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПриемник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПриемникНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПриемникПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПриемникСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПриемникСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПриемникСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CписыватьЗатратыНСБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрУчета</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БазаРаспределенияПриемника</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Доля</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/НастройкиРаспределенияЗатратМСФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьИменаСубконто() Экспорт

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетИсточникСубконто1");
	Субконто.Вставить(2, "СчетИсточникСубконто2");
	Субконто.Вставить(3, "СчетИсточникСубконто3");
	Субконто.Вставить("УчетПоПодразделениям", "СчетИсточникПодразделение");
	Субконто.Вставить("УчетПоНаправлениямДеятельности", "СчетИсточникНаправлениеДеятельности");
	
	Результат.Вставить("СчетИсточник", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетПриемникСубконто1");
	Субконто.Вставить(2, "СчетПриемникСубконто2");
	Субконто.Вставить(3, "СчетПриемникСубконто3");
	Субконто.Вставить("УчетПоПодразделениям", "СчетПриемникПодразделение");
	Субконто.Вставить("УчетПоНаправлениямДеятельности", "СчетПриемникНаправлениеДеятельности");
	
	Результат.Вставить("СчетПриемник", Субконто);
		
	Субконто = Новый Соответствие;
	
	Субконто.Вставить(1, "Субконто1");
	Субконто.Вставить(2, "Субконто2");
	Субконто.Вставить(3, "Субконто3");
	Субконто.Вставить("УчетПоПодразделениям", "Подразделение");
	Субконто.Вставить("УчетПоНаправлениямДеятельности", "НаправлениеДеятельности");
	
	Результат.Вставить("БазаРаспределенияПриемника", Новый Структура("Счет", Субконто));	
		
	Возврат Результат;
	
КонецФункции

#КонецЕсли
